### 1. Membuat dataframe dari list array

In [1]:
import pandas as pd

In [2]:
list_data = [["C1", 5, "Jakarta"], ["C2", 10, "Bogor"], ["C3", 7, "Tangerang"], ["C4", 0, "Jakarta"]]

In [10]:
type(list_data)

list

In [5]:
df = pd.DataFrame(list_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4            0    Jakarta

In [6]:
type(df)

pandas.core.frame.DataFrame

### 2. Membuat dataframe dari numpy array

In [7]:
import numpy as np

In [8]:
numpy_data = np.array(list_data)
numpy_data

array([['C1', '5', 'Jakarta'],
       ['C2', '10', 'Bogor'],
       ['C3', '7', 'Tangerang'],
       ['C4', '0', 'Jakarta']], dtype='<U21')

In [9]:
type(numpy_data)

numpy.ndarray

In [13]:
df = pd.DataFrame(numpy_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id item_bought       city
0      C1           5    Jakarta
1      C2          10      Bogor
2      C3           7  Tangerang
3      C4           0    Jakarta

In [14]:
type(df)

pandas.core.frame.DataFrame

### 3. Membuat dataframe dari dictionary array

In [15]:
dict_data = {"cust_id": ["C1", "C2", "C3", "C4"], 
             "item_bought": [5, 10, 7, 0], 
             "city": ["Jakarta", "Bogor", "Tangerang", "Jakarta"]}

In [16]:
type(dict_data)

dict

In [17]:
df = pd.DataFrame(dict_data)
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4            0    Jakarta

In [18]:
type(df)

pandas.core.frame.DataFrame